xtee55/mediator-common-test/src/main/resources/sdsb-missing-fields.request

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
        xmlns:sdsb="http://x-road.eu/xsd/sdsb.xsd"
        xmlns:id="http://x-road.eu/xsd/identifiers"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Header>
        <sdsb:client id:objectType="SUBSYSTEM">
            <id:sdsbInstance>EE-XROAD DEV</id:sdsbInstance>
            <id:memberClass>GOV</id:memberClass>
            <id:memberCode>70006317</id:memberCode>
            <id:subsystemCode>sdsb1</id:subsystemCode>
        </sdsb:client>
        <sdsb:service id:objectType="SERVICE">
            <id:sdsbInstance>EE-XROAD DEV</id:sdsbInstance>
            <id:memberClass>ENT</id:memberClass>
            <id:memberCode>sdsbts2</id:memberCode>
            <id:serviceCode>sdsbGetRandom</id:serviceCode>
            <id:serviceVersion>v1</id:serviceVersion>
        </sdsb:service>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns4:sdsbGetRandom xmlns:ns4="http://sdsbts2.ee.x-road.ee/producer/">
            <request>
                <seed>100</seed>
            </request>
        </ns4:sdsbGetRandom>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>